In [7]:
import pandas as pd
import numpy as np

In [15]:
df = pd.read_csv('./data/bike.csv')
df.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40

In [16]:
df.iloc[0,0]

'2011-01-01 00:00:00'

In [17]:
df.iloc[:2, :4]

              datetime  season  holiday  workingday
0  2011-01-01 00:00:00       1        0           0
1  2011-01-01 01:00:00       1        0           0

In [18]:
df.iloc[:1, :3]

              datetime  season  holiday
0  2011-01-01 00:00:00       1        0

In [19]:
df.iloc[0, :4]

datetime      2011-01-01 00:00:00
season                          1
holiday                         0
workingday                      0
Name: 0, dtype: object

In [20]:
type(df.iloc[:2, :4])

pandas.core.frame.DataFrame

In [21]:
type(df.iloc[0, :4])

pandas.core.series.Series

In [23]:
df.loc[0:5, :"workingday"]

              datetime  season  holiday  workingday
0  2011-01-01 00:00:00       1        0           0
1  2011-01-01 01:00:00       1        0           0
2  2011-01-01 02:00:00       1        0           0
3  2011-01-01 03:00:00       1        0           0
4  2011-01-01 04:00:00       1        0           0
5  2011-01-01 05:00:00       1        0           0

In [24]:
df_season1 = df[df["season"] == 1]
df_season1.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40

In [25]:
df_season1["season"].unique()

array([1], dtype=int64)

In [26]:
df_season2 = df.loc[df["season"] == 2, ]
df_season2.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
1323,2011-04-01 00:00:00,2,0,1,3,10.66,12.88,100,11.0014,0,6,6
1324,2011-04-01 01:00:00,2,0,1,3,10.66,12.88,100,11.0014,0,4,4

In [27]:
df_season2["season"].unique()

array([2], dtype=int64)